package com.example.love_shayari;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

public class Shayari_Page extends AppCompatActivity {

    int imgarr1[] = {R.drawable.husband,R.drawable.god,R.drawable.love,R.drawable.birthday,R.drawable.holiimg,R.drawable.bearbar,R.drawable.politics,R.drawable.bewfa,R.drawable.santabanta};

    String dostishayari[] = {
            "तेरी मेरी दोस्ती इतनी खास हो,\n" +
            "दुनिया कहे काश ऐसा दोस्त मेरे पास भी हो।",

            "जब भी सुकून की बात आती है,\n" +
            "यार कुछ दोस्तों की बहुत याद आती है ।",

            "जो आसानी से मिले वो हैं.. धोखा \n" +
            "जो दिल से मिले वो हैं …प्यार \n" +
            "जो मुश्किल से मिले वो हैं …इज्ज़त \n" +
            "मगर\n" +
            " जो नसीब से मिले वो हैं …दोस्त ।",

            "चांद की दोस्ती रात से सुबह तक..!!\n" +
            "सूरज की दोस्ती सुबह से रात तक..!!\n" +
            "पर हमारी दोस्ती पहली मुलाकात से, आखरी सांस तक..!!",

            "दोस्त का प्यार दुआ से कम नहीं होता,\n" +
            "दोस्त दूर हो तो भी गम नहीं होता,\n" +
            "प्यार में अक्सर दोस्ती कम हो जाती है,\n" +
            "पर दोस्ती में कभी प्यार कम नहीं होता।",

            "किसी के पास Ego है तो किसी के पास Attitude है," +
            "पर मेरे पास तो पक्के दोस्त है जो करोड़ों के खज़ानों से बढ़कर है ।",

            "रिश्तो से बड़ी कोई चाहत नही होती," +
            "और दोस्ती से बड़ी कोई इबादत नही होती।",

            "हमारी दोस्ती एक-दूजे से ही पूरी है,\n" +
            "वरना रास्ते के बिना तो मंज़िल भी अधुरी है।",

            "बच्चे वसीयत पूछते है ,रिश्ते हैशियत पूछते है,\n" +
            "वो दोस्त ही है जो मेरी खैरियत पूछते है।",

            "लिफाफे में पड़े वो खत अब पुराने हो गए,\n" +
            "सच्चे दोस्तो से मिले अब हमे जमाने हो गए।"
    };

    String godshayari[] = {
            "ईश्वर पर आप तभी विश्वास कर सकते हैं,\n" +
            "जब आपको खुद पर विश्वास हो " +
            "क्योकि " +
            "ईश्वर बाहर नही हमारे अंदर ही हैं!!",

            "मुझे अपने आप में कुछ यु बसा लो," +
            "के ना रहू जुदा तुमसे और खुद से तुम हो जाऊ!",

            "कहने की जरूरत नही, " +
            "आना ही बहुत हैं," +
            "शिव भक्ति में तेरा शीश झुकाना ही बहुत हैं!!",

            "श्रद्धा का मतलब हैं आत्मविश्वास," +
            "और आत्मविश्वास का मतलब हैं ईश्वर में विश्वास!",

            "जब ईश्वर मनुष्य की परीक्षा लेते हैं," +
            "तब वो मनुष्य का सामर्थ्य भी बढ़ा देते हैं," +
            "ताकि वो अधिक बुद्धिमान और अधिक ताकतवर बनें!!",


            "इधर नहीं उधर नहीं अंदर हूं मैं तेरे अरे कहा\n" +
            "खोजता हैं तू मुझे देख ज़रा उन बच्चों के चेहरे।",

            "“सदा खुश रहने के लिए ईश्वर\n" +
            "और मौत को सदा याद रखे",

            "अगर तुम उसे सिर्फ वर माँगने के लिए जानते हो,\n" +
            "तो न कहो तुम ईश्वर को मानते हो",

            "“ईश्वर” आपके मन के पिंजरे में कैद,\n" +
            "जो आपसे कुछ अच्छा काम करवाने के लिए तड़फड़ाता हैं।",

            "ईश्वर-वह आस्था जो आस्तिक\n" +
            "को जीने का उमंग देती हैं।",

            "“राधा” नाम के रस में तन मन भीग जाता है\n" +
            "सुनकर “राधा” नाम तो “सांवरिया” भी रीझ जाता है",

            "कर दिया है बेफिक्र तूने ऐ प्रभु, अब फिक्र मैं कैसे करूँ\n" +
            "फिक्र तो ये है कि, तेरा शुक्र मैं कैसे करूँ…"
    };

    String loveshayari[] = {
            "ये मोहब्बत है जनाब कितनी भी,\n" +
            "तकलीफ दे मगर सुकून भी उसी,\n" +
            "की बाहों में मिलता है !",

            "ये जो हर बात पर नाराज होते है,\n" +
            "ना वही लोग सबसे,\n" +
            "ज़्यादा प्यार करने वाले होते है !",

            "कुछ हदें हैं मेरी कुछ हदें हैं तेरी !\n" +
            "लेकिन दायरों में भी इश्क़ होता है !",

            "होते तुम पास तो कोई शरारत करते,\n" +
            "लेकर तुम्हे बाहों में बेपनाह मोहब्बत करते !",

            "सुना है तुम ले लेते हो हर बात का बदला,\n" +
            "अजमाएगे कभी तुम्हारे होठो\n" +
            "को चूम कर !",

            "नहीं है अब कोई जुस्तजू इस दिल में ए सनम,\n" +
            "मेरी पहली और आखिरी आरजू बस तुम हो !",

            "वो लम्हा बना दो मुझे…\n" +
            "जो गुजर कर भी… तुम्हारे साथ रहे…!!",

            "कुछ यूँ उतर गए हो मेरी रग-रग में तुम,\n" +
            "कि खुद से पहले एहसास तुम्हारा होता है।",

            "मेरे सीने में एक दिल है❤\n" +
            "उस दिल की धड़कन हो तुम…",

            "पाना और खोना तो किस्मत की बात है,\n" +
            "मगर चाहते रहना तो अपने हाथ में है।",

            "होते तुम पास तो कोई शरारत करते…\n" +
            "लेकर तुम्हे बाहों में बेपनाह मोहब्बत करते…",

            "अच्छा लगता है हर रात तेरे ख्यालों में खो जाना\n" +
            "जैसे दूर हो कर भी तेरी बाहों में सो जाना…",

            "वक्त कितना भी बदल जाए….\n" +
            "मेरी मोहब्बत कभी नही बदलेगी..!!❤",

            "द नही कुछ पर याद जैसा कुछ तो है,\n" +
            "दरम्यान तेरे मेरे प्यार कैसा कुछ तो है।",

            "वो मेरे हाल पर रोया भी मुस्कुराया भी,\n" +
            "अजीब शख्स है अपना भी है पराया भी.!",
    };

    String brithdayshayari[] = {
            "फूलों ने अमृत का जाम भेजा है,\n" +
            "सूरज ने गगन से सलाम भेजा है,\n" +
            "मुबारक हो आपको नया जन्मदिन,\n" +
            "तहे-दिल से हमने ये पैगाम भेजा है।\n" +
            "हैप्पी बर्थडे टू यू",

            "जीवन में आर्शीवाद मिले बड़ों से, सहयोग मिले छोटों से,\n" +
            "ख़ुशी मिले दुनिया से, प्यार मिले सब से,\n" +
            "यही दुआ है मेरी रब से।\n" +
            "जन्मदिन की हार्दिक शुभकामनाएं",

            "तेरे चेहरे पर मुस्कान यूं ही खिलती रहे\n" +
            "तू जिंदगी के हर इम्तिहान में अव्वल रहे\n" +
            "तेरे जीवन में बस मिठास ही हो\n" +
            "शुभकामनाओं के साथ जन्मदिन मुबारक हो",

            "जन्मदिन का ये लम्हा मुबारक हो आपको\n" +
            "ख़ुशियों का ये लम्हा मुबारक हो आपको\n" +
            "आने वाला कल लाये\n" +
            "आपके लिये ख़ुशियाँ हज़ार और\n" +
            "वो ख़ुशियाँ मुबारक हो आपको\n" +
            "Wish You A Very Happy Birthday",

            "आशाओं के दीप जले\n" +
            "आशीर्वाद उपहार मिले\n" +
            "जन्मदिन है तुम्हारा\n" +
            "शुभकामनाओं संग खूब प्यार मिले\n" +
            "जन्मदिन मुबारक हो",

            "उपहारों की ढेर फूलों के हार\n" +
            "जन्मदिन पर मिले तुम्हें अपनों से\n" +
            "ढेर सारा प्यार..!!",

            "खुशियां तुम्हारे दर पर आए गमों को\n" +
            "घर से दूर भगाएं इसी कामना के साथ\n" +
            "आओ दोस्त तुम्हारा जन्मदिन मनाएं..!!",

            "जन्मदिन पर आपको मिले ढेर सारा प्यार\n" +
            "आज के जैसे आपके जीवन में\n" +
            "आते रहे हमेशा खुशियों के उपहार..!!",
            
            "मिले जिंदगी और खुशियों की बरसात हो\n" +
            "हर दुख सुख में आपके अपने साथ हो..!!",

            "तेरे केक काटने से पहले तेरी सारी दुआएं\n" +
            "कबूल हो जाए\n" +
            "तू जिंदगी में इतना खुश रहे कि तुझे देखकर\n" +
            "फरिश्ते भी मुस्कुराए..!!",

            "आपकी जिंदगी में लगे खुशियों का सेक\n" +
            "हमेशा करते रहे जिंदगी में काम नेक\n" +
            "और बर्थडे पर हमेशा खिलाते रहे यूं ही केक..!!"
    };

    String holishayari[] = {
            "जमाने के लिए आज होली है,\n" +
            "मुझे तो तेरी यादे रोज रंग देती है…",

            "दिल ने एक बार ओर हमारा कहना माना है..\n" +
            "इस होली पर फिर हमें उन्हें रंगने जाना है।।",

            "लाल,गुलाबी,नीला,पीला हाथों में रंग लिए समेट…\n" +
            "होली के दिन रंगेंगे सजनी, कर के मीठी भेंट।",

            "पिचकारी की धार गुलाल की बौशार , \n" +
            "अपनों का प्यार यही है यारों होली का त्यौहार",

            "गिले शिकवे भुला कर खुशियां मनाओ सभी,\n" +
            "चलो होली आ गई दिल से दिल मिलाओ सभी।",

            "मेरी जान मेरे साथ हो तो खुशियाँ हैं, \n" +
            "मस्ती है ठिठोली है… \n" +
            "बिना मेरे प्यारी जानेमन बीवी \n" +
            "के क्या सूनी सूनी होली है..",

            "पिचकारी की धार, गुलाल की बौछार,\n" +
            "अपनों का प्यार, यही है यारों होली का त्यौहार।",

            "ऐसे मनाना होली का त्योंहार,\n" +
            "पिचकारी से बरसे सिर्फ #Pyaar…\n" +
            "Ye मौसम है अपनो Se गले मिलने का,\n" +
            "तो गुलाल लेकर हो जाओ तैयार\n" +
            "#Wish you a very very #Happy Holi",

            "अर्ज़ है … #सर में दर्द हो तो खा लो #सिरदर्द की गोली वाह …वाह ..\n" +
            "सर में दर्द हो तो खा लो सिरदर्द की Goli .. वाह …वाह\n" +
            "मुबारक हो आपको #हैप्पी_होली.. #हैप्पी_होली",

            "खा के गुजिया,\n" +
            "पी के भंग,\n" +
            "लगा के थोड़ा थोड़ा सा रंग,\n" +
            "बजा के ढोलक और मृदंग,\n" +
            "खेलें होली हम तेरे संग\n" +
            "Happy Holi 2023"
    };

    String sharabishayari[] = {
            "शराब और मेरा कई बार ब्रेकअप हो चुका है,\n" +
            "पर कमबख्त हर बार मुझे मना लेती है।",

            "जाम पीने का मजा जिंदगी जीने से जादा हैं,\n" +
            "अगर इसे न पिया तो जिंदगी जीने का मजा क्या हैं !",

            "तू डालता जा साकी शराब मेरे प्यालो में,\n" +
            "जब तक वो न निकले मेरे ख्यालों से !",

            "कुछ तो शराफत सीख ले ए इश्क शराब से,\n" +
            "बोतल पे लिखा तो है मैं जान लेवा हूँ !",

            "थोड़ी सी पी शराब थोड़ी उछाल दी,\n" +
            "कुछ इस तरह से हमने जवानी निकाल दी !",

            "यूँ तो ना थी जनम से पीने की आदत,\n" +
            "शराब को तन्हा देखा तो तरस खा के पी गये।",

            "उन्हीं के हिस्से में आती है ये प्यास अक्सर,\n" +
            "जो दूसरों को पिलाकर शराब पीते हैं !",

            "एक वक्त था जब तेरी आँखों से पी कर जीते थे,\n" +
            "लाख बुरे थे लेकिन शराब कभी नहीं पीते थे ।",

            "कभी देखेंगे ऐ जाम तुझे होठों से लगाकर,\n" +
            "तू मुझमें उतरता है कि मैं तुझमें उतरता हूँ ।",

            "नशा हम किया करते हैं,\n" +
            "इल्ज़ाम शराब को दिया करते हैं,\n" +
            "कसूर शराब का नहीं उनका है,\n" +
            "जिसका चेहरा हम जाम में तलाश किया करते हैं !",

            "रहता हूँ बहका बहका तो शराबी ना समझना,\n" +
            "कभी किसी की यादें भी बहका दिया करती हैं !"
    };

    String politicsshayari[] = {
            "चोर, बेईमान और भ्रष्ट नेताओं की क्यों करते हो बात,\n" +
            "लोकतंत्र की ताकत है जनता में, दिखला दो इनकी औकात.",

            "जहाँ सच हैं, वहाँ पर हम खड़े हैं,\n" +
            "इसी खातिर आँखों में गड़े हैं.",

            "नेता भी क्या खूब ठगते हैं,\n" +
            "ये तो 5 साल बाद ही दिखते हैं.",

            "नजर वाले को हिन्दू और मुसलमान दिखता हैं,\n" +
            "मैं अन्धा हूँ साहब, मुझे तो हर शख्स में इंसान दिखता हैं.",

            "लोकतंत्र जब अपने असली रंग में आता हैं,\n" +
            "तो नेताओं की औकात का पता चल जाता हैं.",

            "तुम से पहले वो जो इक शख़्स यहाँ तख़्त-नशीं था,\n" +
            "उस को भी अपने ख़ुदा होने पे इतना ही यक़ीं था.",

            "सियासत ने मोहब्बत ख़त्म कर दी\n" +
            "लगा दी आग सारी बस्तियों में",

            "एक तरफ उंगलियों पे चुनाव की कालिख\n" +
            "एक तरफ उड़ती दिखे शमशान की कालिख",

            "शेर खुद अपनी ताकत से जंगल का\n" +
            "राजा कहलाता है जंगल में चुनाव नहीं\n" +
            "होते वरना चिड़ीया जानवर भी बादशाह कहलाते !!",

            "जहाँ सच हैं वहाँ पर हम खड़े हैं\n" +
            "इसी खातिर आँखों में गड़े हैं !!",

            "चुनावों में दुनिया को देखो मुस्कुराती\n" +
            "और खुशिया बनाती नजर आएगी !",

            "ऐसा कोई ईलाका नही जहां अपना कहर\n" +
            "नहीं ऐसी कोई मोहल्ला नही\n" +
            "जहां अपनी चली नही !!"
    };

    String bewfashayari[] = {
            "हम इश्क़ में वफ़ा करते करते बेहाल हो गए,\n" +
            "और वो बेवफाई करके भी खुशहाल हो गए।",

            "जब आपको बिना गलती के सजा मिले,\n" +
            "तो उसे Bewafai कहा जाता है।",

            "मोहब्बत में ऐसा क्यों होता है,\n" +
            "बेवफाई में वो रोते हैं और वफ़ा में हम रोए हैं।",

            "सब कुछ होते हुए भी इस दिल का दर्द नहीं जाता,\n" +
            "क्यूंकि किस्मत ने हमें Bewafai बना दिया।",

            "दुनिया वालों का भी अजीब दस्तूर है बेवफाई मेहबूब से मिलती है ,\n" +
            "और बेवफा मोहब्बत बन जाती है।",

            "हमने ये सोचा वो वापिस आए हमारी मोहब्बत के लिए,\n" +
            "मगर वो बेवफा वापिस आए सिर्फ अपने काम के लिए!",

            "कोमल, दयालु लगते थे जो हसीन लोग,\n" +
            "वास्ता पड़ा तो कठोर और पत्थर के निकले…",

            "ये मैं अक्सर सोचता हूँ की वो हमें कैसे भूल गए होंगे,\n" +
            "शायद हमें बेवफा मान कर, भूलने कीवजह मिल गयी होगी ।",

            "अब मैंने खुद का धयान रखना शुरू कर दिया है,\n" +
            "क्योंकि धयान रखने वाले अब बदल चुके है।",

            "दिल ढूढें जिसे जो बेवफा है\n" +
            "जो किसी और का हो गया, बेवफाई करके हमें रोता हुआ छोड़ गया\n" +
            "… फिर भी ये दिल उसको ही ढूंढ़ता है, ये कैसी चाहत हे यारों…? जो बेवफा हे…",

            "हम गम, तन्हाई और जुदाई से मरते रहे\n" +
            "और वो बेवफा बनके चुप बैठे रहे ।",

            "उसने Bewafai में सभी हदें पार कर दी,\n" +
            "मोहब्बत का नाटक हमारे साथ और वफ़ा किसी गैर के साथ।"
    };

    String  othershayari[] = {
            "सारी दुनिया छोड़ के मैंने तुझको अपना बनाया था,\n" +
            "करोगे याद सदियों तक किसी ने दिल लगाया था !",

            "कहानी अच्छी हो या बुरी किरदार,\n" +
            "तुम्हारा सब का दिल जीत लेना चाहिए !",

            "तेरा तो गुस्सा भी इतना अच्छा लगता है,\n" +
            "कि मन करता है दिन भर तुम्हें ही तंग करती रहूँ !",

            "उन्होंने पूछा तोहफे में क्या चाहिए आपको,\n" +
            "हमने कहा वो मुलाकात जो कभी, \n" +
            "खत्म ना हो !",

            "कभी-कभी थक जाइये जब जीवन की भागदौड़ से\n" +
            "तो खुद के लिए भी कुछ वक्त निकाल लीजिये !",

            "रोज वो ख्वाब में आते हैं गले मिलने को,\n" +
            "मैं जो सोता हूँ तो जाग उठती है किस्मत मेरी !",

            "Kisi Bhi Mausam Mein Khareed Leejiye Janaab,\n" +
            "Mohabbat Ke Zakhm Taro-Taaza Hi Milenge.",

            "Bheed Bahut Hai Iss Mahobat Ke Shaher Mein,\n" +
            "Ek Baar Jo Bichhda Wo Dobaara Nahi Milta.",

            "Uljhi Nigaahon Se Musalsal Mujhe Dekhta Raha,\n" +
            "Aayine Mein Khada Shakhs Pareshaan Bahut Tha.",

            "Ruk-Ruk Ke Log Dekh Rahe Hai Meri Taraf,\n" +
            "Tumne Jara Si Baat Ko Akhbaar Kar Diya.",

            "Kahaan Milta Hai Kabhi Koi Samajhne Wala,\n" +
            "Jo Bhi Milta Hai Samajha Ke Chala Jaata Hai."
    };

    ListView listview;
    NewAdapter adapter;
    String list[];
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_listview_shayari);
        listview = findViewById(R.id.listview_shayari_1);
        int position = getIntent().getIntExtra("pos",0);



        if(position==0){
           list=dostishayari;
        }
        if (position==1) {
            list=godshayari;
        }
        if (position==2) {
            list = loveshayari;
        }

        if (position==3) {
            list = brithdayshayari;
        }

        if (position==4) {
            list = holishayari;
        }

        if (position==5) {
            list = sharabishayari;
        }

        if (position==6) {
            list = politicsshayari;
        }

        if (position==7) {
            list = bewfashayari;
        }
        if (position==8) {
            list = othershayari;
        }
        adapter = new NewAdapter(Shayari_Page. this,imgarr1[position],list);
        listview.setAdapter(adapter);

        listview.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                Intent intent = new Intent(Shayari_Page.this, Detailes_Shayari.class);
                intent.putExtra("pos",position);
                intent.putExtra("shayari",list);
                startActivity(intent);
            }
        });
    }
}